app/controllers/categories_controller.rb

  def create
    @category = Category.new(params_category)
    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Garden"], ["created_at", "2022-12-26 10:28:24.866181"], ["updated_at", "2022-12-26 10:28:24.866181"]]

  def update
    @category = Category.find(params[:id])
    if @category.update(params_category)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Kid"], ["updated_at", "2022-12-26 10:27:59.404953"], ["id", 1]]

  def destroy
    @category = Category.find(params[:id]).destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]