app/controllers/sub_categories_controller.rb

  def index
    @sub_categories = @category.sub_categories.all
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1  [["category_id", 1]]

  def show
    @sub_category = SubCategory.find(params[:id])
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @sub_category = SubCategory.new(params_sub_category)
    if @sub_category.save
---
INSERT INTO "sub_categories" ("name", "created_at", "updated_at", "category_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Toys"], ["created_at", "2022-12-26 11:33:55.913749"], ["updated_at", "2022-12-26 11:33:55.913749"], ["category_id", 1]]

  def edit
    @sub_category = SubCategory.find(params[:id])
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @sub_category = SubCategory.find(params[:id])
    if @sub_category.update(params_sub_category)
---
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "sub_categories" SET "name" = $1, "updated_at" = $2 WHERE "sub_categories"."id" = $3  [["name", "Toy"], ["updated_at", "2022-12-26 11:52:35.415337"], ["id", 1]]

  def destroy
    @sub_category = SubCategory.find(params[:id]).destroy
---
DELETE FROM "sub_categories" WHERE "sub_categories"."id" = $1  [["id", 3]]
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def find_category
    if params[:category_id]
      @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]