app/models/user.rb

    def self.find_for_database_authentication warden_condition
        conditions = warden_condition.dup
        if(login = conditions.delete(:login))
            where(conditions).where(["lower(username) = :value OR lower(email) = :value",{ value: login.strip.downcase}]).first
---
SELECT "users".* FROM "users" WHERE (lower(username) = 'admin' OR lower(email) = 'admin') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]